% apfft_afreq.m测试程序
% 对多频信号进行校正
% Update:2009-12-11 14:12:08 
%经反复测试：程序apfft在采样点数是采样频率两倍减1时表现最好，【因为该方法实际先计算数据样本中点相位】
%如若采样频率为512，则采样点数为1023时，该程序效果最好
% 
clear all;clc;close all
%
% 生成多频率成分仿真信号
fs=5120;  %采样频率
N=2048;
t=0:1/fs:(N-1)/fs;
f1=40.4333333;   f2=95.933333;     f3=106.833333;  f4=125.5;
a1=0.88888888;   a2=0.7888888;     a3=0.8888888;  a4=1.588888;
ph1=230.11111;   ph2=50.11111;     ph3=10.11111;  ph4=30.1111;


y=a1*sin(2*pi*t*f1+ph1*pi/180)+a2*sin(2*pi*t*f2+ph2*pi/180)...
   +a3*sin(2*pi*t*f3+ph3*pi/180)+a4*sin(2*pi*t*f4+ph4*pi/180);
[Af_0,xf]=myspecfft(y,fs,1);
xlim([0 500])
%%
% 校正结果
clc
f10=40;
f20=98;
f30=105;
f40=2;
%
[f_mod,a_mod,p_mod]=FK_apfft_afreqNoLowFreq(y,fs,[f1 f2 f3 f4],1)

